tutorials/multiphase/compressibleInterFoam/laminar/cylinder/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    "(sides|frontAndBack)"
    {
        type            fixedFluxPressure;
    }

    top
    {
        type            totalPressure;
        p0              $internalField;
        rho             thermo:rho;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
